In [37]:
# Importaciones
import pandas as pd
import numpy as np

import sys 
sys.path.append('..')

from src import sp_limpieza as lp

In [38]:
# Leer los archivos
archivo1 = pd.read_excel("../data_raw/customer-details.xlsx", sheet_name='2012')
archivo2 = pd.read_excel("../data_raw/customer-details.xlsx", sheet_name='2013')
archivo3 = pd.read_excel("../data_raw/customer-details.xlsx", sheet_name='2014')

# Concatenar
df_total_cd = pd.concat([archivo1, archivo2, archivo3], ignore_index=True)

In [39]:
df_total_cd.tail()

,Unnamed: 0,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
43165,14085,156980,1,2,2014-05-17,7,5f432048-d515-4bb5-9c94-62db451f88d4
43166,14086,139820,0,0,2014-09-29,1,993bbbd6-4dbc-4a40-a408-f91f8462bee6
43167,14087,78470,2,2,2014-10-28,12,d6271666-319d-42c8-a741-cb22bf2c2093
43168,14088,144218,0,1,2014-07-01,9,f67fbfa8-6573-414d-a805-b26a2f1b1ceb
43169,14089,115155,0,2,2014-12-25,7,9727bc06-c11a-461a-a5bb-3d210467cc2a

In [40]:
df_total_cd.shape
print (f'El número de filas del conjunto de datos es : {df_total_cd.shape[0]}')
print (f'El número de columnas del conjunto de datos es : {df_total_cd.shape[1]}')

El número de filas del conjunto de datos es : 43170
El número de columnas del conjunto de datos es : 7

In [41]:
df_total_cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         43170 non-null  int64
 1   Income             43170 non-null  int64
 2   Kidhome            43170 non-null  int64
 3   Teenhome           43170 non-null  int64
 4   Dt_Customer        43170 non-null  datetime64[ns]
 5   NumWebVisitsMonth  43170 non-null  int64
 6   ID                 43170 non-null  object
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 2.3+ MB

In [52]:
# Crear un dataframe alternativo para trabajar
df_cust = df_total_cd.copy()

In [53]:
df_cust.columns

Index(['Unnamed: 0', 'Income', 'Kidhome', 'Teenhome', 'Dt_Customer',
       'NumWebVisitsMonth', 'ID'],
      dtype='object')

In [54]:
# Elimino la columna Unnamed al ser el índice generado automáticamente por pandas
df_cust.drop(columns="Unnamed: 0", inplace=True)
df_cust.tail(3)

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
43167,78470,2,2,2014-10-28,12,d6271666-319d-42c8-a741-cb22bf2c2093
43168,144218,0,1,2014-07-01,9,f67fbfa8-6573-414d-a805-b26a2f1b1ceb
43169,115155,0,2,2014-12-25,7,9727bc06-c11a-461a-a5bb-3d210467cc2a

In [68]:
df_cust = df_cust.rename(columns={'ID': 'Id'})
df_cust = df_cust.rename(columns={'NumWebVisitsMonth': 'Num_Web_Visits_Month'})

In [69]:
lp.eda_preliminar(df_cust)

,Income,Kidhome,Teenhome,Dt_Customer,Num_Web_Visits_Month,Id
34112,39952,1,2,2014-04-21,18,A3abf6fd-fa18-4e18-b450-11d4042d4251
30937,50502,2,1,2014-06-11,15,6e77d6f4-d2fd-4dfa-a4ec-16216ef3ba73
23726,12399,0,0,2013-08-03,22,8d2fb571-f2e3-40db-9700-f3e96470cfd5
26745,103966,0,0,2013-03-15,16,3c9072a2-63b9-4ae9-9da0-b438a5a7918f
17502,48705,0,1,2012-07-09,19,5ef79e5f-2439-467f-9c66-845b29f873ed

-------------------------------------
INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Income                43170 non-null  int64
 1   Kidhome               43170 non-null  int64
 2   Teenhome              43170 non-null  int64
 3   Dt_Customer           43170 non-null  datetime64[ns]
 4   Num_Web_Visits_Month  43170 non-null  int64
 5   Id                    43170 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 2.0+ MB

None

-------------------------------------
NULOS

Income                  0.0
Kidhome                 0.0
Teenhome                0.0
Dt_Customer             0.0
Num_Web_Visits_Month    0.0
Id                      0.0
dtype: float64

-------------------------------------
DUPLICADOS

np.int64(0)

-------------------------------------
VALUE COUNTS
Id
9727bc06-c11a-461a-a5bb-3d210467cc2a    1
089b39d8-e4d0-461b-87d4-814d71e0e079    1
8ae75057-3e2d-4374-ab52-37918aa6fd79    1
E15ed01e-30e9-4b8c-9ac6-0cc08f14e067    1
Aa0fe258-b4a5-48e4-a5dd-69e96e2158ce    1
                                       ..
D63ede72-0b6d-45b1-8872-385ac6897f65    1
5e3483e5-236d-437d-8351-541f9d09b9dd    1
87fdc08b-30ae-4dab-803f-561ecdf27ff0    1
87b79988-2be5-419d-88f4-56655852c565    1
Ea6b7d04-9271-4c0a-a01f-07795d164aba    1
Name: count, Length: 43170, dtype: int64
------------------------------------

In [70]:
df_cust.sample()

,Income,Kidhome,Teenhome,Dt_Customer,Num_Web_Visits_Month,Id
2792,153862,1,2,2012-08-13,25,Fac1e1ad-c3c4-4562-8878-091d9c976d42

In [71]:
# Guardo archivo
df_cust.to_excel("../data_processed/cd_modificaciones.xlsx", index=False)